InformationRegisters/ОсновныеДолжностиПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеДолжностиПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоступКДаннымПоЗП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсновныеДолжностиПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОсновныеДолжностиПредприятия/Forms/ФормаСпискаПоПользователю/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
    Форма = ПолучитьФорму("РегистрСведений.ОсновныеДолжностиПредприятия.Форма.ФормаЗаписи");
	Форма.Запись.Предприятие = Элемент.ТекущиеДанные.Предприятие;
	Форма.Запись.Должность = Элемент.ТекущиеДанные.Должность;
	Форма.Запись.Сотрудник = Элемент.ТекущиеДанные.Сотрудник;
	Форма.Открыть()
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДату(Команда)
	
	Форма = ПолучитьФорму("РегистрСведений.ОсновныеДолжностиПредприятия.Форма.ФормаЗаписи", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
	Форма.Элементы.Предприятие.Доступность = Ложь;
	Форма.Элементы.Должность.Доступность = Ложь;
	Форма.Элементы.Сотрудник.Доступность = Ложь;
	Форма.Открыть()
	
КонецПроцедуры
